import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function DisplayUA() {
  return (
    <>
      <Table id="css_display">
        <TableBody>
          <TableOneCol text={<h2>Відображення елементів.</h2>} />
          <TableTwoCol
            title={<h3>display: block</h3>}
            text={
              <p>
                Блокові елементи розташовуються одна над одною, вертикально.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>display: inline</h3>}
            text={<p>Елементи розміщуються на тому ж рядку, послідовно.</p>}
          />
          <TableTwoCol
            title={<h3>display: inline-block</h3>}
            text={
              <p>
                Це значення означає елемент, який продовжує перебувати в рядку
                (inline), але може мати важливі властивості блоку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>display: inline-table</h3>}
            text={
              <p>
                Визначає, що елемент є таблицею як при використанні тега &lt;
                table &gt;, але при цьому таблиця є вбудованою елементом і
                відбувається її обтікання іншими елементами, наприклад текстом.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>display: inline-flex</h3>}
            text={
              <p>
                Вбудована версія flex дозволяє елементу та його дочірнім
                елементам мати властивості flex, залишаючись при цьому у
                звичайному потоці документа / веб-сторінки. В принципі, ви
                можете розмістити два вбудований гнучкий контейнер в одному
                рядку, якщо ширина була досить мала, без зайвого стилю, щоб
                дозволити їм існувати в одному рядку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>display: flex</h3>}
            text={
              <p>
                Це скорочена властивість, що визначає здатність гнучкого
                елемента розтягуватися або стискатися для заповнення собою
                доступного вільного простору.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>display: flexbox</h3>}
            text={
              <p>
                Ефективно справляється з вирівнюванням, розподілом та напрямом
                елементів сторінки. Двома основними поняттями цієї моделі макету
                є головна вісь та поперечна вісь. Головна вісь flex-контейнера –
                це основний напрямок, вздовж якого вишиковуються flex-елементи,
                поперечна ж вісь їй перпендикулярна.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>display: grid</h3>}
            text={
              <p>
                Це набір горизонтальних і вертикальних ліній, що перетинаються,
                які створюють розмірність і позиціонують систему координат для
                контенту в самому grid-контейнері.
              </p>
            }
          />
        </TableBody>
      </Table>
      <Table id="css_flex">
        <TableBody>
          <TableOneCol text={<h3>Flex.</h3>} />
          <TableTwoCol
            title={<h3>flex-direction:</h3>}
            text={
              <p>
                Допомагає змінити порядок розташування блоків.
                <br />
                row - Елементи розміщуються за напрямом тексту.
                <br />
                row-reverse - Елементи відображаються у зворотному порядку до
                направлення тексту. <br />
                column - Елементи розміщуються зверху донизу. <br />
                column-reverse - Елементи розташовуються знизу нагору.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>flex-wrap:</h3>}
            text={
              <p>
                Переносить об'єкт на новий рядок якщо він вилазить за область,
                також можна змінити розташування блоків.
                <br />
                nowrap - Розміри елементів встановлюються автоматично, щоб вони
                помістилися до одного ряду. <br />
                wrap - Елементи автоматично переносяться на новий рядок.
                <br />
                wrap-reverse - Елементи автоматично переносяться на нову рядок,
                але рядки розташовані у зворотному порядку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>flex-flow:</h3>}
            text={
              <p>
                Є скороченням для окремих властивостей flex-direction та
                flex-wrap.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>flex-basis:</h3>}
            text={<p>Вказує базовий розмір елемента.</p>}
          />
          <TableTwoCol
            title={<h3>flex-grow:</h3>}
            text={
              <p>
                Дозволяє збільшити розмір елемента за рахунок порожнього
                простору.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>flex-shrink:</h3>}
            text={
              <p>
                Дозволяє зменшити розмір контейнера за рахунок свого простору.
              </p>
            }
          />
        </TableBody>
      </Table>
      <Table id="css_grid">
        <TableBody>
          <TableOneCol text={<h3>Grid.</h3>} />
          <TableTwoCol
            title={<h3>gap (grid-gap):</h3>}
            text={
              <p>
                Створює відступи між блоками. Відступ задається за допомогою %,
                em, px і т.д.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-column-gap:</h3>}
            text={<p>Створює відступи між рядами.</p>}
          />
          <TableTwoCol
            title={<h3>grid-row-gap:</h3>}
            text={<p>Створює відступи між рядками.</p>}
          />
          <TableTwoCol
            title={<h3>grid-auto-columns:</h3>}
            text={<p>Задає однакову ширину всім блокам.</p>}
          />
          <TableTwoCol
            title={<h3>grid-auto-flow:</h3>}
            text={
              <p>
                Дозволяє змінити послідовність розміщення блоків з
                горизонтальний на вертикальний. <br />
                row - Вертикальне розташування. <br />
                columns - Горизонтальне розташування.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-auto-rows:</h3>}
            text={<p>Задає однакову висоту всім блокам.</p>}
          />
          <TableTwoCol
            title={<h3>grid-column:</h3>}
            text={
              <p>
                Дозволяє вказати початкову та кінцеву позицію будь-якого блоку
                по вертикалі. <br />
                grid-column: 1/3;
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-column-end:</h3>}
            text={
              <p>
                Дозволяє вказати кінцеву позицію будь-якого блоку по вертикалі.
                <br />
                grid-column-end: 3;
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-column-start:</h3>}
            text={
              <p>
                Дозволяє вказати початкову позицію будь-якого блоку по
                вертикалі.
                <br />
                grid-column-start: 1;
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-row:</h3>}
            text={
              <p>
                Дозволяє вказати початкову та кінцеву позицію будь-якого блоку
                по горизонталі. <br />
                grid-row: 1/3;
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-row-end:</h3>}
            text={
              <p>
                Дозволяє вказати кінцеву позицію будь-якого блоку по
                горизонталі.
                <br />
                grid-row-end: 3;
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-row-start:</h3>}
            text={
              <p>
                Дозволяє вказати початкову позицію будь-якого блоку по
                горизонталі.
                <br />
                grid-row-start: 1;
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-area:</h3>}
            text={<p>Дозволяє виділити область (шапка, секція та футер).</p>}
          />
          <TableTwoCol
            title={<h3>grid-template-areas:</h3>}
            text={<p>Створює області з об'єктів.</p>}
          />
          <TableTwoCol
            title={<h3>grid-template-columns:</h3>}
            text={
              <p>
                Вказує кількість колонок та їх розміри завширшки. <br />
                repeat (auto-fill) – Створює простір для ефемерних елементів.
                <br />
                repeat (auto-fit) - Не створює простір для ефемерних елементів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>grid-template-rows:</h3>}
            text={<p>Вказує кількість рядів та їх розміри у висоту.</p>}
          />
        </TableBody>
      </Table>
      <Table id="css_otherElement">
        <TableBody>
          <TableOneCol text={<h3>Розміщення елементів.</h3>} />
          <TableTwoCol
            title={<h3>align-content:</h3>}
            text={
              <p>
                Вирівнювання елементів та заповнення ними контейнера. <br />
                flex-start – Елементи групуються у верхній частині контейнера.
                <br />
                flex-end – Елементи групуються у нижній частині контейнера.
                <br />
                center - Елементи групуються вертикально центром контейнера.
                <br />
                space-between - Елементи відображаються з однаковими відстанями
                між ними. <br />
                space-around - Елементи відображаються з однаковими відстанями
                довкола них. <br />
                space-evenly - Елементи відображаються з однаковими відстанями
                навколо них. <br />
                stretch - Ряди розтягуються, щоб заповнити контейнер поступово.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>align-items:</h3>}
            text={
              <p>
                Здійснює вирівнювання всіх елементів усередині флексу контейнера
                вздовж поперечної осі.
                <br />
                center - Елементи розташовуються по центру рядка контейнера
                (Середина поперечної осі, або осі стовпця). <br />
                flex-start - Елементи розміщуються на початку рядка контейнера.
                <br />
                flex-end - Елементи розміщуються в кінці рядка контейнера.
                <br />
                baseline - Елементи розташовуються з їхньої базової лінії.
                <br />
                initial - Встановлює властивість значення за замовчуванням.
                <br />
                inherit - Вказує, що значення успадковується від батьківського
                елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>align-self:</h3>}
            text={
              <p>
                Вирівнює флекс-елементи поточного рядка, переписуючи значення
                align-items.
                <br />
                auto - Бере батьківське значення align-items або stretch, якщо
                немає батька. <br />
                flex-start - Елемент вирівнюється на початку поперечної осі
                контейнера. <br />
                flex-end - Елемент вирівнюється в кінці поперечної осі
                контейнера. <br />
                center - Елемент вирівнюється по центральній лінії поперечної
                осі. <br />
                baseline - Елемент вирівнюється за базовою лінією тексту. <br />
                stretch - Елемент розтягується таким чином, щоб зайняти все
                вільне простір контейнера по поперечній осі.
              </p>
            }
          />

          <TableTwoCol
            title={<h3>justify-items:</h3>}
            text={
              <p>
                Здійснює вирівнювання всіх елементів макету сітки по осі рядка.
                <br />
                stretch - Елементи розтягуються за розміром рядка комірки
                контейнер. <br />
                center - Елементи розміщуються в середині кожної комірки
                контейнера. <br />
                start - Елементи розміщуються по початковому краю осередків.
                <br />
                end - Елементи розміщуються по кінцевому краю осередків. <br />
                baseline - Елементи розташовуються за їхньою базовою лінією.
                <br />
                initial - Встановлює властивість значення за умовчанням.
                <br />
                inherit - Вказує, що значення успадковується від батьківського
                елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>justify-content:</h3>}
            text={
              <p>
                Здійснює вирівнювання всіх елементів усередині флексу контейнера
                по вертикалі.
                <br />
                flex-start - Елементи позиціонуються на початку контейнера.
                <br />
                flex-end - Елементи позиціонуються наприкінці контейнера.
                <br />
                center- Елементи позиціонуються у центрі контейнера.
                <br />
                space-between - Елементи відображаються з однаковими відстанями
                між ними. <br />
                space-around - Елементи відображаються з однаковими відстанями
                навколо них. <br />
                space-evenly - Елементи відображаються з однаковими відстанями
                навколо них. <br />
                initial - Встановлює властивість значення за замовчуванням.
                <br />
                inherit - Вказує, що значення успадковується від батьківського
                елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>justify-self:</h3>}
            text={
              <p>
                Здійснює вирівнювання елемента макету сітки всередині комірки по
                осі рядки.
                <br />
                stretch - Елемент розтягується за розміром стовпця комірки
                контейнер. <br />
                center - Елемент розташовується по центру стовпця комірки
                контейнера. <br />
                start - Елемент розташовується по початковому краю осередку.
                <br />
                end - Елемент розташовується по кінцевому краю комірки. <br />
                baseline - Елемент розташований за його базовою лінією.
                <br />
                initial - <br />
                Встановлює властивість значення по замовчуванням. <br />
                inherit - Вказує, що значення успадковується від батьківського
                елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>place-content:</h3>}
            text={
              <p>
                Дозволяє вам вирівнювати вміст як по блочному, так і по
                вбудованому напрямкам одночасно (тобто за властивостями і) в
                відповідній системі макета, такий як Grid або Flexbox
                .place-content align-contentjustify-content
              </p>
            }
          />
          <TableTwoCol
            title={<h3>place-items:</h3>}
            text={
              <p>
                Дозволяє одночасно вирівнювати елементи і колонки, і ряду
                (тобто. за властивостями align-items та justify-items) у
                відповідній системі розкладки, наприклад Grid або Flexbox. Якщо
                встановлено одне значення, воно використовується для
                вирівнювання і в колонці, і в ряді.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>place-self:</h3>}
            text={
              <p>
                Дозволяє вам вирівнювати окремий елемент одночасно як у
                блочному, і у лінійному напрямі (тобто властивості і )
                відповідної системи макета, такий як Grid або Flexbox. Якщо
                друге значення відсутнє, для нього також використовується перше
                значення.place-self align-selfjustify-self
              </p>
            }
          />
          <TableTwoCol
            title={<h3>order:</h3>}
            text={
              <p>
                Дозволяє переміщати окремі дочірні елементи на всі боки (-1, 0,
                1).
              </p>
            }
          />
          <TableTwoCol
            title={<h3>clear:</h3>}
            text={<p>Дозволяє прибрати обтічність при використанні.</p>}
          />
          <TableTwoCol
            title={<h3>clip:</h3>}
            text={
              <p>
                Обрізає область прямокутника. Все, що не міститься в цю область
                буде обрізана і стає невидимою.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>float:</h3>}
            text={
              <p>
                Визначає, з якого боку вирівнюватиметься елемент, при цьому
                решта елементів буде обтікати його з інших сторін. Коли значення
                властивості float і none, елемент виводиться на сторінці як
                завжди, при цьому допускається, що один рядок тексту, що обтікає
                може бути на тій самій лінії, що і сам елемент.
                <br />
                left - вирівнює елемент по лівому краю, а всі інші елементи, на
                кшталт тексту, обтікають його праворуч.
                <br />
                right - Вирівнює елемент з правого краю, а решта елементи
                обтікають його ліворуч. <br />
                none - Обтікання елемента не задається. <br />
                inherit - успадковує значення батька.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow:</h3>}
            text={
              <p>
                Дозволяє обрізати вміст, який не вміщується в блок, також можна
                створити скрол.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-anchor:</h3>}
            text={
              <p>
                Дозволяє відмовитися від поведінки прив'язки прокручування
                браузера, яке регулює положення прокручування, щоб звести до
                мінімуму зрушення вмісту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-block:</h3>}
            text={
              <p>
                Встановлює, що буде відображатися, коли вміст переповнює
                початкові та кінцеві краї блоку. Це може бути нічого, смуга
                прокручування або вміст переповнення.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-clip-margin:</h3>}
            text={
              <p>
                Визначає, наскільки далеко за межі своїх кордонів може бути
                зафарбований елемент, перш ніж він буде обрізаний.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-inline:</h3>}
            text={
              <p>
                Встановлює, що відображається, коли вміст виходить за межі
                вбудованих початкового та кінцевого країв блоку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-wrap:</h3>}
            text={
              <p>
                Застосовується до рядкових елементів, встановлюючи чи повинен
                браузер розставляти переноси рядків усередині нерозривного
                рядка, щоб уникнути виходу тексту за межі елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-x:</h3>}
            text={
              <p>
                Керує відображенням вмісту блокового елемента по горизонталі,
                якщо контент цілком не міститься і виходить за область зверху
                або знизу від блоку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>overflow-y:</h3>}
            text={
              <p>
                Керує відображенням вмісту блокового елемента по вертикалі, якщо
                контент повністю не міститься і виходить за область зверху чи
                знизу від блоку.
                <br />
                visible - Відображається весь вміст елемента, навіть за межами
                встановленої висоти. <br />
                hidden - Відображається лише область всередині елемента, інше
                буде приховано. <br />
                scroll - Завжди додається вертикальна смуга прокручування.
                <br />
                auto - Залежно від браузера. В основному, вертикальна смуга
                прокручування додається лише за потреби.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>visibility:</h3>}
            text={
              <p>
                Призначений для відображення або приховування елемента,
                включаючи рамку навколо нього та фону. При прихованні елемента,
                хоча він і стає не видно, місце, яке елемент займає, залишається
                за ним. Якщо передбачається виведення різних елементів в те саме
                місце екрану, для обходу цієї особливості слід використовувати
                абсолютне позиціонування або користуватися властивістю display.
                <br />
                visible - Відображає елемент як видимий.
                <br />
                hidden - Елемент стає невидимим чи правильніше сказати, повністю
                прозорим, оскільки він продовжує брати участь у форматуванні
                сторінки. <br />
                collapse - Якщо це значення застосовується не до рядкам чи
                колонкам таблиці, то результат його використання буде так само,
                як hidden. У разі використання collapse для вмісту осередків
                таблиць, то задані рядки і колонки забираються, а таблиця
                перебудовується за новою. <br />
                inherit - Наслідує значення батька.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>inset-block:</h3>}
            text={
              <p>
                Визначає початкове та кінцеве зміщення логічного блоку елемента,
                яке зіставляється з фізичною вставкою залежно від режиму запису
                елемента, напряму та орієнтації тексту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>inset-block-end:</h3>}
            text={<p>Тільки кінцеве усунення.</p>}
          />
          <TableTwoCol
            title={<h3>inset-block-start:</h3>}
            text={<p>Тільки початкове усунення.</p>}
          />
          <TableTwoCol
            title={<h3>inset-inline:</h3>}
            text={
              <p>
                Визначає логічне початкове та кінцеве зміщення елемента у
                вбудованому напрямі, які зіставляються з фізичними зсувами
                залежно від режиму запису елемента, напряму та орієнтації
                тексту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>inset-inline-end:</h3>}
            text={<p>Тільки кінцеве усунення.</p>}
          />
          <TableTwoCol
            title={<h3>inset-inline-start:</h3>}
            text={<p>Тільки початкове усунення.</p>}
          />
          <TableTwoCol
            title={<h3>opacity:</h3>}
            text={
              <p>
                Встановлює непрозорість елемента. Непрозорість – це ступінь, в
                якій вміст ховається за елементом, є протилежністю прозорості.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>object-fit:</h3>}
            text={
              <p>
                Керує співвідношенням елементів, що замінюються, таких як &lt;
                img &gt; та &lt; video &gt;, коли у них задана ширина або
                висота, а також способом масштабування. Властивість object-fit
                може зберігати вихідні пропорції елемента або навпаки,
                спотворювати пропорції, задля дотримання розмірів.
                <br />
                fill - Елемент масштабується, щоб відповідати заданим розмірів,
                у своїй пропорції ігноруються. <br />
                contain - Елемент масштабується, щоб повністю вміститися в
                задані розміри із дотриманням пропорцій. <br />
                cover - Елемент збільшується або зменшується, щоб повністю
                заповнити задану область із збереженням пропорцій. <br />
                none - Зберігаються вихідні пропорції елемента, встановлені
                Значення ширини або висоти не впливають на вміст.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>object-position:</h3>}
            text={
              <p>
                Визначає вирівнювання контенту вибраного заміщуваного елемента
                елемент всередині блоку. На областях блоку, не покритих об'єктом
                елемента, що заміщується, буде відображатися фон елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>perspective:</h3>}
            text={
              <p>
                Визначає відстань від площини екрана до точки збіжності ліній і
                цим ставить, наскільки виражений ефект перспективи. Крапка
                змовності за замовчуванням розташовується в центрі елемента і
                може бути змінена за допомогою властивості perspective-origin.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>perspective-origin:</h3>}
            text={
              <p>
                Задає координати точки, куди дивиться спостерігач. Ця
                властивість працює спільно з властивістю perspective та визначає
                точку збіжності ліній за перспективи.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
