import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function PositionUA() {
  return (
    <>
      <Table id="css_position">
        <TableBody>
          <TableOneCol text={<h2>Позиціювання.</h2>} />
          <TableTwoCol
            title={<h3>position: static</h3>}
            text={
              <p>
                Це значення дозволяє елементу перебувати у звичайному його
                стані, розташованому на своєму місці у документі. Властивості
                top, right, bottom, left та z-index не застосовуються до цього
                елемента. Це значення за замовчуванням.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>position: relative</h3>}
            text={
              <p>
                Елемент позиціонується відповідно до нормального потоку
                документа, а потім зміщується щодо себе на основі значень top,
                right, bottom та left. Усунення не впливає на становище
                будь-яких інших елементів; таким чином, простір, заданий для
                елемента у макеті сторінки, таке саме, якби позиція була static.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>position: absolute</h3>}
            text={
              <p>
                Елемент видаляється зі звичайного потоку документів, і для
                елемента в макеті сторінки не створюється пробілу. Він
                розташований щодо нього найближчого щодо позиціонованого предка,
                якщо такий є; в іншому випадку він міститься щодо вихідного
                містить блоку. Його кінцева позиція визначається значеннями top,
                right, bottom, і left.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>position: fixed</h3>}
            text={
              <p>
                Елемент вибивається зі звичайного потоку документа, і для
                елемента в макеті сторінки не створюється простір.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>position: sticky</h3>}
            text={
              <p>
                Елемент позиціонується відповідно до нормального потоку
                документа, а потім зміщується щодо його найближчого прокручує
                предка і містить блоку (найближчий батьківський рівень блоку),
                включаючи елементи, пов'язані з таблицею, на основі значень top,
                right, bottom, та left. Зміщення не впливає на становище
                будь-яких інших елементів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>z-index:</h3>}
            text={
              <p>
                Будь-які позиціоновані елементи на веб-сторінці можуть
                накладатися один на одного в певному порядку, імітуючи цим третє
                вимірювання, перпендикулярне екрану. Кожен елемент може бути як
                нижче, так і вище за інші об'єкти веб-сторінки, їх розміщенням
                по z-осі та управляє z-index. Ця властивість працює тільки для
                елементів, у яких значення position задано як absolute, fixed
                або relative.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
