import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function PseudoElementsUA() {
  return (
    <>
      <Table id="css_pseudoElements">
        <TableBody>
          <TableOneCol text={<h2>Псевдоелеенти.</h2>} />
          <TableTwoCol
            title={<h3>::after</h3>}
            text={
              <p>
                Він часто використовується для додавання в кінці вмісту до
                елемента з content властивістю.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::before</h3>}
            text={
              <p>
                Він часто використовується для додавання на початку вмісту до
                елемента з content властивістю.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::backdrop</h3>}
            text={
              <p>
                Псевдоелемент відображається нижче верхнього елемента в стеку по
                осі Z, але вище за всіх інших елементів на сторінці, якщо вони
                є. Зазвичай застосовується для затемнення сторінки, щоб
                акцентувати увагу на фотографії або діалоговому вікні, які
                виводяться поверх такого затемнення.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::cue</h3>}
            text={
              <p>
                Він може бути використаний для завдання стилів титрів та інших
                реплік медіа з VTT треками.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::first-letter</h3>}
            text={
              <p>
                Визначає стиль першого символу в тексті елемента, до якого
                додається. Це дозволяє створювати в тексті буквицю та
                виступаючий ініціал.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::first-line</h3>}
            text={
              <p>
                Визначає стиль першого рядка блокового тексту. Довжина цього
                рядка залежить від багатьох факторів, таких як використовуваний
                шрифт, розмір вікна браузера, ширина блоку, мови тощо.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::marker</h3>}
            text={
              <p>
                Застосовує стилі до маркеру списку, який зазвичай містить значок
                або номера. Працює з будь-яким елементом або псевдоелементом, до
                якого встановлено display: list-item, наприклад, у такого як
                &lt;li&gt; або &lt;summary&gt;.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::part()</h3>}
            text={
              <p>
                Представляє будь-який елемент у тіньовому дереві, який має
                відповідний атрибут.::part
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::placeholder</h3>}
            text={
              <p>
                Псевдоелемент, за допомогою якого задається стильове оформлення
                підказуючого тексту, створеного атрибутом placeholder.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::selection</h3>}
            text={
              <p>
                Дозволяє змінити (color, background-color, text-decoration та
                text-shadow) для тексту, що виділяється.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>::slotted()</h3>}
            text={
              <p>
                Є будь-який елемент, поміщений у слот всередині HTML-шаблону.
              </p>
            }
          />
        </TableBody>
      </Table>
      <Table id="css_pseudoClasses">
        <TableBody>
          <TableOneCol text={<h2>Псевдокласи.</h2>} />
          <TableTwoCol
            title={<h3>:active</h3>}
            text={<p>Активний елемент.</p>}
          />
          <TableTwoCol
            title={<h3>:hover</h3>}
            text={<p>При наведенні на елемент.</p>}
          />
          <TableTwoCol
            title={<h3>:visited</h3>}
            text={<p>Відвіданий елемент.</p>}
          />
          <TableTwoCol
            title={<h3>:link</h3>}
            text={<p>Для посилань ще не відвіданих.</p>}
          />
          <TableTwoCol
            title={<h3>:focus</h3>}
            text={<p>Створює фокус на об'єкті.</p>}
          />
          <TableTwoCol
            title={<h3>:focus-visible</h3>}
            text={
              <p>
                Застосовується, тоді як елемент відповідає псевдокласу :focus, і
                визначає за допомогою евристики, що фокус має бути зроблений
                очевидним для елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:focus-within</h3>}
            text={
              <p>
                Визначає стиль елемента, коли він сам або елементи всередині
                нього отримують фокус.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:not()</h3>}
            text={<p>Можна створити виняток для якогось класу.</p>}
          />
          <TableTwoCol
            title={<h3>:checked</h3>}
            text={
              <p>Працює з чек боксом і радіо, створюючи при цьому бордер.</p>
            }
          />
          <TableTwoCol
            title={<h3>:invalid</h3>}
            text={<p>Коли поле використовується не за призначенням.</p>}
          />
          <TableTwoCol
            title={<h3>:valid</h3>}
            text={<p>Коли поле використовується за призначенням.</p>}
          />
          <TableTwoCol
            title={<h3>:required</h3>}
            text={<p>Задає параметри для обов'язкових полів.</p>}
          />
          <TableTwoCol
            title={<h3>:optional</h3>}
            text={<p>Задає параметри для необов'язкових полів.</p>}
          />
          <TableTwoCol
            title={<h3>:first</h3>}
            text={
              <p>
                Використовується з @-правилом @page, представляючи першу
                сторінку документа під час друку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:first-of-type</h3>}
            text={
              <p>
                Задає правила стилів для першого елемента певного типу в групі
                братніх елементів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:first-child</h3>}
            text={<p>Перший елемент серед групи споріднених елементів.</p>}
          />
          <TableTwoCol
            title={<h3>:last-of-type</h3>}
            text={
              <p>
                Задає правила стилів для останнього елемента певного типу в
                групі братніх елементів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:last-child</h3>}
            text={<p>Останній елемент серед групи споріднених елементів.</p>}
          />
          <TableTwoCol
            title={<h3>:nth-child()</h3>}
            text={
              <p>
                Зіставляє елементи на основі їх положення серед групи братів і
                сестер :nth-child(-n+5), також можна вибрати парні та непарні.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:nth-last-child()</h3>}
            text={
              <p>
                Зіставляє елементи на основі їх положення серед групи братів і
                сестер, рахуючи з кінця :nth-child(-n+5), також можна вибрати
                парні та непарні.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:only-child</h3>}
            text={<p>Є елементом без братів і сестер.</p>}
          />
          <TableTwoCol
            title={<h3>:nth-last-of-type()</h3>}
            text={
              <p>
                Використовується для додавання стилю до елементів зазначеного
                типу на основі нумерації у дереві елементів, відлік ведеться від
                останнього елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:nth-of-type()</h3>}
            text={
              <p>
                Використовується для додавання стилю до елементів зазначеного
                типу на основі нумерації у дереві елементів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:any-link</h3>}
            text={
              <p>
                Являє собою елемент, який діє як вихідний якір гіперпосилання,
                незалежно від того, чи вона була відвідана. Іншими словами, він
                відповідає всім елементам &lt;a&gt;, &lt;area&gt;, або
                &lt;link&gt;, які мають атрибут href. Таким чином, він
                відповідає всім елементам, які використовують :link або
                :visited.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:autofill</h3>}
            text={
              <p>Вибирає такий елемент, який є єдиним нащадком такого типу.</p>
            }
          />
          <TableTwoCol
            title={<h3>:default</h3>}
            text={
              <p>
                Знаходить елемент форми, встановлений за промовчанням для групи
                пов'язаних елементів. Цей селектор використовується для
                елементів: &lt;button&gt;, &lt;input type="checkbox"&gt;,
                &lt;input type="radio"&gt;, та &lt;option&gt;.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:blank</h3>}
            text={
              <p>
                Уявляє порожні елементи, тобто ті, які не містять дочірніх
                елементів або тексту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:defined</h3>}
            text={
              <p>
                Знаходить будь-який елемент, який був визначений, включаючи
                будь-який стандартний елемент, вбудований у браузер, та
                користувацькі елементи.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:disabled</h3>}
            text={<p>Застосовує стиль до заблокованих елементів форм.</p>}
          />

          <TableTwoCol
            title={<h3>:empty</h3>}
            text={
              <p>
                Уявляє порожні елементи, тобто ті, які не містять дочірніх
                елементів, тексту, пропусків або перенесення рядків.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:enabled</h3>}
            text={
              <p>
                Використовується для застосування стилю до доступних (не
                заблокованих) елементам форм.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:fullscreen</h3>}
            text={
              <p>
                Псевдоклас :fullscreen застосовується до елементів, коли браузер
                знаходиться у повноекранному режимі.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:has()</h3>}
            text={
              <p>
                Відображає елемент у тому випадку, якщо будь-який із селекторів,
                переданий як параметр (відносно :scope), відповідає хоча б
                одному елементу.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:host</h3>}
            text={
              <p>
                Вибирає тіньовий хост тіньового DOM, що містить CSS, всередині
                якого він використовується - іншими словами, це дозволяє вам
                вибрати користувальницький елемент усередині його тіньового
                DOM.:host
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:in-range</h3>}
            text={
              <p>
                Застосовується до елементів форм, у яких введено користувачем
                значення знаходиться в заздалегідь заданому діапазоні. Сам
                діапазон встановлюється за допомогою атрибутів min та max, вони,
                відповідно, задають мінімальне та максимальне значення.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:indeterminate</h3>}
            text={
              <p>
                Вказує стиль для елементів форм, таких як прапорці та
                перемикачі, коли вони перебувають у невизначеному стані.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:lang()</h3>}
            text={
              <p>
                Визначає мову, яка використовується в документі або його
                фрагменті.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:left</h3>}
            text={
              <p>
                Використовується з at-правилом @page, надає всі ліві сторінки
                друкованого документа.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:right</h3>}
            text={
              <p>
                Відповідає правильній сторінці під час друку сторінки. Він
                дозволяє вам описати стиль правих сторінок.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:only-of-type</h3>}
            text={
              <p>
                Застосовується до дочірнього елемента вказаного типу, тільки
                якщо він єдиний у батька.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:out-of-range</h3>}
            text={
              <p>
                Застосовується до полів форм, у яких введене користувачем
                значення виходить із заданого діапазону. Псевдоклас працює
                тільки для тих полів, де користувач може сам ввести значення,
                незважаючи на обмеження.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:paused</h3>}
            text={
              <p>
                Це псевдоклас стану ресурсу, який буде відповідати аудіо-,
                відео- або аналогічний ресурс, який може бути «відтворено» або
                «зупинено», коли цей елемент «зупинено».
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:placeholder-shown</h3>}
            text={
              <p>
                Визначає стиль елемента input або textarea, який в даний момент
                відображає текст підказки, заданої атрибутом placeholder.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:playing</h3>}
            text={
              <p>
                Це псевдоклас стану ресурсу, який буде відповідати аудіо-,
                відео- або аналогічний ресурс, який може бути «відтворено» або
                «зупинено», коли цей елемент «зупинено».
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:read-only</h3>}
            text={
              <p>
                Застосовується до полів форми, у яких заданий атрибут readonly.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:read-write</h3>}
            text={<p>Застосовується до полів форми, доступних для зміни.</p>}
          />
          <TableTwoCol
            title={<h3>:root</h3>}
            text={<p>Знаходить кореневий елемент дерева документа.</p>}
          />
          <TableTwoCol
            title={<h3>:scope</h3>}
            text={
              <p>
                Представляє елементи, які є орієнтиром для зіставлення
                селекторів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:target</h3>}
            text={
              <p>
                Застосовується до цільового елемента, іншими словами, до
                ідентифікатора, який вказаний в адресному рядку браузера.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:user-invalid</h3>}
            text={
              <p>
                Дає будь-який перевірений елемент форми, значення якого недійсно
                через їх обмеження перевірки після того, як користувач
                взаємодіяв із ним.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:user-valid</h3>}
            text={
              <p>
                Дає будь-який перевірений елемент форми, значення якого
                правильно перевіряється з урахуванням його обмежень перевірки .
                Однак, у на відміну від цього, :validon відповідає тільки після
                того, як користувач взаємодіяв із ним.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>:where()</h3>}
            text={
              <p>
                В якості аргументу приймається список селекторів і вибирає
                тільки ті елементи, які можна вибрати з переданого списку.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
