import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoEqualCol from "../../core/TableTwoEqualCol.tsx";

export default function VariablesUA() {
  return (
    <Table id="js_variables">
      <TableBody>
        <TableOneCol text={<h2>Змінні.</h2>} />
        <TableOneCol
          text={
            <p>
              Для зберігання даних у програмі використовуються змінні. Змінні
              призначені для зберігання будь-яких тимчасових даних або таких
              даних, які в процесі роботи можуть змінювати своє значення.
            </p>
          }
        />
        <TableTwoEqualCol
          title={<h3>var</h3>}
          text={
            <p>
              Область видимості змінних var обмежується або функцією, або якщо
              змінна глобальна, то скрипт. Такі змінні доступні поза блоку.
              <br />
              Оголошення змінних var обробляються на початку виконання функції
              (або запуску скрипта, якщо змінна є глобальною). Іншими словами,
              змінні var вважаються оголошеними з самого початку виконання
              функції незалежно від того, де функції реально перебувають їх
              оголошення (за умови, що вони не знаходяться у вкладеній функції).
            </p>
          }
        />
        <TableTwoEqualCol
          title={<h3>let</h3>}
          text={
            <p>
              Локальна змінна з областю видимості, обмеженою поточним блоком
              коду. Є перезаписуваною та її можна оновлювати, але не
              перевизначати.
            </p>
          }
        />
        <TableTwoEqualCol
          title={<h3>const</h3>}
          text={
            <p>
              Значення констант не може бути змінено новим наданням, а також не
              може бути перевизначено. Константи підпорядковуються області
              видимості рівня блоку.
            </p>
          }
        />
      </TableBody>
    </Table>
  );
}
