import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function FormUA() {
  return (
    <>
      <Table id="html_form">
        <TableBody>
          <TableOneCol text={<h2>Форми.</h2>} />
          <TableOneCol
            text={
              <p>
                HTML містить кілька елементів, які використовуються разом для
                створення форм, які користувач може заповнити і відправити на
                сервер. Доступно безліч інформації з цієї теми в посібнику з
                HTML форм.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;button&gt; &lt;/button&gt;</h3>}
            text={
              <p>
                Создаёт кликабельную кнопку, которая может быть использована в
                формах или в любом другом месте документа, который требует
                простой, стандартной кнопки. По умолчанию, кнопки HTML обычно
                представлены в стиле, аналогичном стилю хост-платформы, на
                которой работает user agent, но вы можете изменить внешний вид
                кнопки, используя CSS. Атрибуты:
                <br /> accesskey - Доступ к элементам формы с помощью горячих
                клавиш.
                <br /> autofocus - Встановлює, що кнопка отримує фокус після
                завантаження сторінки.
                <br /> disabled - Блокує доступ та зміну елемента.
                <br /> form - Зв'язує між собою форму та кнопку.
                <br /> formaction - Задає адресу, на яку пересилаються дані
                форми при натисканні на кнопку.
                <br /> formenctype - Спосіб кодування даних форми.
                <br /> formmethod - Вказує метод пересилання даних форми.
                <br /> formnovalidate - Скасує перевірку форми на коректність.
                <br /> formtarget - Відкриває результат відправки форми у новому
                вікні або кадрі.
                <br /> name – Визначає унікальне ім'я кнопки.
                <br /> type - Тип кнопки - звичайна, для надсилання даних форми
                на сервер або для очищення форми.
                <br /> value - Значення кнопки, яке буде відправлено на сервер
                або прочитано за допомогою скриптів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;datalist&gt; &lt;/datalist&gt;</h3>}
            text={
              <p>
                Містить набір опцій, доступних для вибору. Вибране значення буде
                встановлено для елемента &lt;input&gt;, з атрибутом list.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;fieldset&gt; &lt;/fieldset&gt;</h3>}
            text={
              <p>
                Використовується для групування кількох елементів керування без
                веб-форм.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;form&gt; &lt;/form&gt;</h3>}
            text={
              <p>
                Представляє собий розділ документа, що містить інтерактивні
                елементи управління, які дозволяють користувачеві відправляти
                інформацію на веб-сервер. Атрибути: <br /> accept-charset -
                Встановлює кодування, в якому сервер може приймати та обробляти
                дані. <br /> action - Адреса програми чи документа, який
                обробляє дані форми. <br />
                autocomplete – Включає автозаповнення полів форми. <br />
                enctype - Спосіб кодування даних форми. method - Метод протоколу
                HTTP. ім'я форми. <br /> novalidate - Скасує вбудовану перевірку
                даних форми на коректність введення. <br /> target - Ім'я вікна
                або кадру, куди обробник буде завантажувати результат, що
                повертається.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;input /&gt;</h3>}
            text={
              <p>
                Використовується для створення інтерактивних елементів керування
                у веб-формах для отримання даних від користувача; в залежності
                від пристрою та user agent, доступний широкий вибір типів
                вхідних даних і віджетів управління. Через величезну кількість
                можливих поєднань типів введення та атрибутів це один із
                найпотужніших і найскладніших елементів HTML. Атрибути: <br />
                accept - Встановлює фільтр на типи файлів, які можна надіслати
                через поле завантаження файлів.
                <br /> accesskey - Перехід до елемента за допомогою комбінації
                клавіш. <br />
                align - Визначає вирівнювання зображення. <br /> alt -
                Альтернативний текст для кнопки із зображенням. <br />
                autocomplete - Вмикає або вимикає автозаповнення. <br />
                autofocus - Встановлює фокус у полі форми. <br /> border -
                Товщина рамки навколо зображення. <br /> checked - Попередньо
                активований перемикач або прапорець. <br />
                disabled - Блокує доступ та зміну елемента. <br /> form -
                Зв'язує поле з формою за її ідентифікатором. <br />
                formaction - Визначає адресу обробника форми.
                <br /> formenctype - Встановлює спосіб кодування даних форми при
                їх надсиланні на сервер. <br /> formmethod - повідомляє браузеру
                яким методом слід передавати дані форми на сервер.
                <br /> formnovalidate - Скасує вбудовану перевірку даних на
                коректність. <br /> formtarget - Визначає вікно або кадр у яке
                завантажуватиметься результат, що повертається обробником форми.
                <br />
                list - Вказує на список варіантів, які можна вибирати під час
                введення тексту. <br />
                max - Верхнє значення для введення чи дати. <br /> maxlength -
                Максимальна кількість символів дозволених текст. <br />
                min - Нижнє значення для введення числа чи дати. <br />
                multiple - Дозволяє завантажити кілька файлів одночасно.
                <br />
                name - Ім'я поля, призначене для того, щоб обробник форми міг
                його ідентифікувати. <br /> pattern - Встановлює шаблон
                введення. <br /> placeholder - Виводить текст, що підказує.
                <br /> readonly - Встановлює, що поле не може змінюватися
                користувачем. <br /> required - Обов'язкове для заповнення поле.
                <br />
                size – ширина текстового поля. <br /> src - Адреса графічного
                файлу для поля із зображенням. <br />
                step - крок збільшення для числових полів. <br /> tabindex -
                Визначає порядок переходу між елементами за допомогою кнопки
                Tab. <br /> type - Повідомляє браузеру, до якого типу
                відноситься елемент форми. <br />
                value - значення елемента.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;label&gt; &lt;/label&gt;</h3>}
            text={
              <p>
                Являє собою підпис до елемента інтерфейсу користувача. Атрибути:
                <br /> accesskey - Доступ до елементів форми за допомогою
                гарячих кнопок. <br />
                for - Ідентифікатор елемента, з яким слід встановити зв'язок.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;legend&gt; &lt;/legend&gt;</h3>}
            text={
              <p>
                Являє собою заголовок змісту батьківського елемента fieldset.
                Атрибути: <br /> accesskey - Перехід до групи елементів форми за
                допомогою комбінації клавіш. <br />
                align - Визначає вирівнювання тексту. <br />
                title - Додає підказку до тексту заголовка.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;meter&gt; &lt;/meter&gt;</h3>}
            text={
              <p>
                Є скалярним значенням в межах відомого діапазону або дробового
                значення. Атрибути: <br /> value - Встановлює значення.
                Обов'язковий атрибут. <br /> min - Задає мінімально можливе
                значення. <br /> max - Задає максимально можливе значення.
                <br /> low - Визначає межу, при досягненні якої значення
                вважається низьким. <br /> high - Визначає межу, при досягненні
                якої значення вважається високим.
                <br /> optimum - Визначає найкраще чи оптимальне значення.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;optgroup&gt; &lt;/optgroup&gt;</h3>}
            text={
              <p>
                Позволяет группировать опции, находящиеся внутри элемента 
                &lt;select&gt;.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;option&gt; &lt;/option&gt;</h3>}
            text={
              <p>
                Використовується для визначення пункту списку контейнера,
                елемента optgroup, або елемента datalist. Елемент &lt;option&gt;
                може представляти розділ меню спливаючих вікон та інших
                переліків чи списків HTML документа. Атрибути: <br /> disabled -
                Заблокувати елемент списку для доступу. <br />
                label - Вказує позначку пункту списку. <br /> selected -
                Заздалегідь встановлює певний пункт списку виділеним. <br />
                value - Значення пункту списку, яке буде відправлено на сервер
                або прочитано за допомогою скриптів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;output&gt; &lt;/output&gt;</h3>}
            text={
              <p>
                Є контейнерним елементом, у якому сайт або програма можуть
                виводити результати обчислень чи дій користувача.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;progress&gt; &lt;/progress&gt;</h3>}
            text={
              <p>
                Відображає індикатор, що показує хід виконання завдання,
                зазвичай відображається у вигляді прогресу бару (індикатора
                виконання).
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;select&gt; &lt;/select&gt;</h3>}
            text={
              <p>
                Є елементом управління який містить меню опцій. Атрибути:
                <br /> accesskey - Дозволяє перейти до списку за допомогою
                деякого сполучення клавіш. <br /> autofocus - Встановлює, що
                список отримує фокус після завантаження сторінки. <br />
                disabled - Блокує доступ та зміну елемента. <br />
                form – пов'язує список з формою.
                <br />
                multiple - Дозволяє одночасно вибирати одразу кілька елементів
                списку. <br />
                name - Ім'я елемента для відправки на сервер або звернення через
                скрипти. required Список обов'язковий для вибору перед
                відправкою форми. <br /> size - Кількість рядків списку, що
                відображаються.
                <br /> Tabindex - Визначає послідовність переходу між елементами
                при натисканні на клавішу.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;textarea&gt; &lt;/textarea&gt;</h3>}
            text={
              <p>
                Є елементом форми для створення області, в яку можна вводити
                кілька рядків тексту. Атрибути:
                <br /> accesskey - Перехід до поля за допомогою клавіш.
                <br /> autofocus - Автоматичне фокусування. <br /> cols - Ширина
                поля у символах. <br /> disabled - Блокує доступ та зміну
                елемента. <br />
                form - пов'язує текстове поле з формою за її ідентифікатором.
                <br /> maxlength - Максимальна кількість введених символів.
                <br /> name - Ім'я поля, призначене для того, щоб обробник форми
                міг його ідентифікувати. <br /> placeholder - Вказує текст, що
                заміщується. <br /> readonly - Встановлює, що поле не може
                змінюватися користувачем. <br /> required - Обов'язкове для
                заповнення поле.
                <br />
                rows – Висота поля в рядках тексту. <br /> Tabindex - Порядок
                переходу між елементами при натисканні на клавішу Tab. <br />
                wrap - Параметри перенесення рядків.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
