import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function MultimediaUA() {
  return (
    <>
      <Table id="html_multimedia">
        <TableBody>
          <TableOneCol text={<h2>Зображення та мультимедіа.</h2>} />
          <TableOneCol
            text={
              <p>
                HTML дозволяє використовувати різні мультимедійні ресурси, такі
                як зображення, аудіо і відео.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;area /&gt;</h3>}
            text={
              <p>
                Визначає активну область на зображенні та, за бажання, пов'язує
                її з гіпертекстовим посиланням. Цей елемент використовується
                лише всередині елемента &lt;map&gt;. Атрибути:
                <br /> alt - це текст, який відображається, якщо веб-браузер не
                може відобразити зображення.
                <br /> coords - це рядок, який вказує координати області на
                зображенні. Це рядок містить чотири числа, які відповідають
                координатам лівого верхнього кута та правого нижнього кута
                області.
                <br /> href - це посилання, до якого можна перейти, коли
                користувач натисне на цю область на зображенні.
                <br /> nohref - це атрибут, який вказує, що область не має
                посилання.
                <br /> shape - це атрибут, який вказує форму області. Доступні
                значення: default , rect , circle , poly.
                <br /> target - це атрибут, який вказує, яке вікно браузера
                відкриється, коли користувач натисне на цю область на
                зображенні. Доступні значення: _self , _blank , _parent , _top.
                <br /> title - це текст, який відображається, коли користувач
                наводить курсор на область на зображенні.
                <br /> accesskey - це символ, який можна натиснути на
                клавіатурі, щоб перейти до цієї області на зображенні.
                <br /> tabindex - це атрибут, який вказує, що область може бути
                наведена на зображенні за допомогою клавіатури.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;map&gt; &lt;/map&gt;</h3>}
            text={
              <p>
                Використовується з елементами area для визначення карти
                зображення (інтерактивної області посилань). Атрибути:
                <br /> name - це ім'я, яке використовується для відображення
                зображення.
                <br /> coords - це рядок, який вказує координати областей на
                зображенні. Це рядок містить чотири числа, які відповідають
                координатам лівого верхнього кута та правого нижнього кута
                області.
                <br /> shape - це атрибут, який вказує форму областей на
                зображенні. Доступні значення: default , rect , circle , poly.
                <br /> href - це посилання, до якого можна перейти, коли
                користувач натисне на зображення.
                <br /> alt - це текст, який відображається, якщо веб-браузер не
                може відобразити зображення.
                <br /> target - це атрибут, який вказує, яке вікно браузера
                відкриється, коли користувач натисне на зображення. Доступні
                значення: _self , _blank , _parent , _top.
                <br /> usemap - це атрибут, який вказує, яке зображення
                використовується для відображення областей. Це рядок, який
                містить ім'я зображення.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;audio&gt; &lt;/audio&gt;</h3>}
            text={
              <p>
                Використовується для вбудовування звукового вмісту в документ.
                Він може містити один або більше джерел аудіо, представлених за
                допомогою атрибуту src або елемента source - браузер вибере один
                найбільш підходящий. Він також може призначатися для потокового
                мультимедіа, використовуючи інтерфейс MediaStream. Атрибути:
                <br />
                autoplay – автоматично відтворюються треки. <br />
                controls – створює елемент управління. <br />
                loop - програвач автоматично повертатиметься в початок при
                досягненні кінця аудіо.
                <br />
                muted - відключений звук із початку. <br />
                preload – завантажує файл разом зі сторінкою. <br />
                src – посилання на аудіо.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;img /&gt; &lt;&gt;</h3>}
            text={<p>Вбудовує зображення у документ. Це замінний елемент.</p>}
          />
          <TableTwoCol
            title={<h3>&lt;track /&gt; </h3>}
            text={
              <p>
                Використовується як дочірній елемент медіа-елементів
                &lt;audio&gt; і &lt;video&gt;. Дозволяє вказати синхронізовані
                текстові доріжки (або дані на основі часу), наприклад для
                автоматичної обробки субтитрів. Файли треків використовують
                формат WebVTT (.vtt файли) — Web Video Text Tracks або Timed
                Text Markup Language (TTML).
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;video&gt; &lt;/video&gt;</h3>}
            text={
              <p>
                Для вбудовування відео контенту у документ. Відео елемент може
                містити одне або кілька джерел відео. Щоб вказати джерело відео,
                необхідно використовувати атрибут src або елемент source;
                браузер сам визначить найбільш відповідне джерело.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
