import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function SectioningUA() {
  return (
    <>
      <Table id="html_sectioning">
        <TableBody>
          <TableOneCol text={<h2>Секціонування змісту.</h2>} />
          <TableOneCol
            text={
              <p>
                Секціонування змісту елементів дозволяє розкласти вміст
                документа на логічні частини. Використовуйте секціонування
                елементів для створення загальних рис змісту сторінки, включаючи
                шапку та підвал та заголовні елементи для позначення розділів.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;address&gt; &lt;/address&gt;</h3>}
            text={
              <p>
                Задає контактні дані для найближчого батьківського
                &lt;article&gt; або &lt;body&gt;. В останньому випадку
                застосовується до всього документа, що візуально виділяється
                курсивом.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;article&gt; &lt;/article&gt;</h3>}
            text={
              <p>
                Надає самостійну частину документа, сторінки, програми або
                сайту, призначену для незалежного розповсюдження або повторного
                використання.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;aside&gt; &lt;/aside&gt;</h3>}
            text={
              <p>
                Є частиною документа, чий вміст лише опосередковано пов'язані з
                основним вмістом документа.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;footer&gt; &lt;/footer&gt;</h3>}
            text={
              <p>
                Являє собою нижній колонтитул (футер, підвал) для свого
                найближчого секційного контенту або секційного кореня. Футер
                зазвичай містить інформацію про автора розділу, інформацію про
                авторське право або посилання на пов'язані документи.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;header&gt; &lt;/header&gt;</h3>}
            text={
              <p>
                Являє собою вступний контент, зазвичай групу вступних або
                навігаційних засобів. Він може містити інші елементи заголовки,
                а також логотип, форму пошуку, ім'я автора та інші елементи.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;h1&gt; &lt;/h1&gt;</h3>}
            text={
              <p>
                Елементи &lt;h1&gt; &lt;/h6&gt; є 6 рівнів заголовків секцій.
                &lt;h1&gt; це найбільший заголовок і &lt;/h6&gt; - найменший.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;main&gt; &lt;/main&gt;</h3>}
            text={
              <p>
                Призначений для основного контенту (вмісту) &lt;body&gt;
                документа (сторінки). Основний контент складається з контенту,
                що безпосередньо належить до головної теми документа або його
                розвиває.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;nav&gt; &lt;/nav&gt;</h3>}
            text={
              <p>
                Визначає окрему секцію документа, призначення якої позначення
                посилань навігації (як усередині поточного документа, так і
                ведучих на іншу сторінку). Як приклад такої секції можна навести
                меню, якірні посилання.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;section&gt; &lt;/section&gt;</h3>}
            text={
              <p>
                Є автономним розділом — який не може бути представлений більш
                точним за семантикою елементом — усередині HTML-документа.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
