import React from "react";
import Table from "@mui/material/Table";
import TableBody from "@mui/material/TableBody";
import TableOneCol from "../../core/TableOneCol.tsx";
import TableTwoCol from "../../core/TableTwoCol.tsx";

export default function TextSemanticsUA() {
  return (
    <>
      <Table id="html_textSemantics">
        <TableBody>
          <TableOneCol text={<h2>Вбудовані текстові семантики.</h2>} />
          <TableOneCol
            text={
              <p>
                Використовуйте вбудовану в текстову семантику HTML, щоб
                визначити зміст, структуру або стиль тексту, ліній або частини
                тексту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;a&gt; &lt;/a&gt;</h3>}
            text={
              <p>
                Визначає гіперпосилання для переходу на певне місце на сторінці
                або на іншу сторінку в Інтернеті. Також він може бути
                використаний для створення якоря – це місце призначення для
                гіперпосилань усередині сторінки: так посилання не обмежені лише
                в переміщенні між сторінками.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;abbr&gt; &lt;/abbr&gt;</h3>}
            text={
              <p>
                Є абревіатурою і, опціонально, може показувати її розшифровку.
                Розшифровка записується в атрибут &lt;title&gt;. Інші значення
                &lt;title&gt;, крім розшифровки абревіатури, не допускаються.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;bdi&gt; &lt;/bdi&gt;</h3>}
            text={
              <p>
                HTML-элемент &lt;bdi&gt; изолирует от окружающего текста
                текстовый фрагмент, направление в котором может отличаться от
                направления окружающего текста (но не обязательно отличается).
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;bdo&gt; &lt;/bdo&gt;</h3>}
            text={
              <p>
                Перевизначення двонаправленого тексту перевизначає поточний
                напрямок тексту так, що текст усередині відображається в іншому
                напрямку.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;br /&gt; </h3>}
            text={<p>Переносить вміст на новий рядок.</p>}
          />
          <TableTwoCol
            title={<h3>&lt;cite&gt; &lt;/cite&gt;</h3>}
            text={
              <p>
                Являє собою посилання на джерело цитати. Він має включати в себе
                назву твору або URL, який може бути в скороченому вигляді
                відповідно до правил, що використовуються для додавання
                метаданих цитування.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;code&gt; &lt;/code&gt;</h3>}
            text={
              <p>
                Відображає його вміст у стилі, призначеному для вказівки на те,
                що текст є коротким фрагментом комп'ютерного коду.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;data&gt; &lt;/data&gt;</h3>}
            text={<p>Зв'язує цей вміст з машиночитаним уявленням.</p>}
          />
          <TableTwoCol
            title={<h3>&lt;dfn&gt; &lt;/dfn&gt;</h3>}
            text={
              <p>
                Використовується для визначення терміна, що визначається в
                контексті фрази або речення.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;em&gt; &lt;/em&gt;</h3>}
            text={
              <p>
                Елемент відзначає акцентований текст. Елемент &lt;em&gt; може
                бути вкладеним, причому кожен рівень вкладеності вказує на
                велику міру акценту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;kbd&gt; &lt;/kbd&gt;</h3>}
            text={
              <p>
                Вказує на те, що текст всередині елемента описує введення
                користувача з клавіатури, голосове введення або введення з
                використанням іншого типу пристроїв введення тексту.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;mark&gt; &lt;/mark&gt;</h3>}
            text={
              <p>
                Подає текст, виділений у довідкових цілях через свою
                актуальність у певному контексті. Наприклад, він може бути
                використаний на сторінці з результатом пошуку, на якій
                виділяється кожен екземпляр шуканого слова.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;q&gt; &lt;/q&gt;</h3>}
            text={
              <p>
                Вказує, що укладений у ньому текст є короткою вбудованою
                цитатою. Більшість сучасних браузерів реалізують це, укладаючи
                текст у лапки.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;rp&gt; &lt;/rp&gt;</h3>}
            text={
              <p>
                Використовується для резервних дужок для браузерів, які не
                підтримують відображення рубінових анотацій з використанням
                елемента. Один елемент повинен заключати в себе кожну з дужок,
                що відкривають і закривають, що містять в собі елемент, що
                містить текст анотації. &lt;rt&gt;, &lt;rp&gt;, &lt;ruby&gt;.
                <ruby>
                  漢 <rp>(</rp>
                  <rt>kan</rt>
                  <rp>)</rp> 字 <rp>(</rp>
                  <rt>ji</rt>
                  <rp>)</rp>
                </ruby>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;rt&gt; &lt;/rt&gt;</h3>}
            text={
              <p>
                Елемент визначає компонент ruby-тексту ruby-анотації, який
                використовується для надання інформації про вимову, переклад або
                транслітерацію для східноазіатської друкарні. Елемент завжди
                повинен знаходитись усередині елемента. &lt;rt&gt;, &lt;rp&gt;,
                &lt;ruby&gt;.
                <ruby>
                  漢 <rp>(</rp>
                  <rt>kan</rt>
                  <rp>)</rp> 字 <rp>(</rp>
                  <rt>ji</rt>
                  <rp>)</rp>
                </ruby>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;ruby&gt; &lt;/ruby&gt;</h3>}
            text={
              <p>
                Призначений для додавання невеликої інструкції зверху або знизу
                від заданого тексту. Така форма запису переважно
                використовується для ідеографічної писемності на зразок
                китайської мови, але може застосовуватися й для інших мов, якщо
                потрібно написати один текст над іншою.
                <ruby>
                  明日 <rp>(</rp>
                  <rt>Ashita</rt>
                  <rp>)</rp>
                </ruby>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;samp&gt; &lt;/samp&gt;</h3>}
            text={
              <p>
                Використовується для увімкнення вбудованого тексту, який
                представляє зразок (або цитату) виведення комп'ютерної програми.
                Його вміст зазвичай відображається за допомогою моноширинного
                шрифту браузера за замовчуванням.
                <br />
                <samp>
                  Keyboard not found <br />
                  Press F1 to continue
                </samp>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;small&gt; &lt;/small&gt;</h3>}
            text={
              <p>
                Це побічні коментарі та дрібний шрифт, такі як авторські права
                та юридичний текст, незалежно від його стилю подання.
                <br />
                <small>
                  The content is licensed under a Creative Commons
                  Attribution-ShareAlike 2.5 Generic License.
                </small>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;span&gt; &lt;/span&gt;</h3>}
            text={
              <p>
                Є основним рядковим контейнером для фразового контенту, який,
                сутнісно, ​​нічого не представляє. Він може використовуватися
                для групування елементів з метою стилізації (використання
                атрибутів class або id) або тому, що вони має загальні значення
                атрибутів, наприклад lang.
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;sub&gt; &lt;/sub&gt;</h3>}
            text={
              <p>
                Нижній індекс, наприклад Н<sub>2</sub>О
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;sup&gt; &lt;/sup&gt;</h3>}
            text={
              <p>
                Верхній індекс, наприклад x<sup>2</sup>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;time&gt; &lt;/time&gt;</h3>}
            text={
              <p>
                Використовується для подання або часу у 24-годинному форматі,
                або точної дати за Григоріанським календарем (з опціональним
                зазначенням часу та часового поясу).
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;s&gt; &lt;/s&gt;</h3>}
            text={
              <p>
                Відображає текст із закресленням або перекресленою лінією.
                <br />
                <s>This can't be real!</s>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;u&gt; &lt;/u&gt;</h3>}
            text={
              <p>
                Підкреслює текс лінією.
                <br />
                <u>This can't be real!</u>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;b&gt; &lt;/b&gt;</h3>}
            text={
              <p>
                Відображають вміст жирним шрифтом.
                <br />
                <b>This can't be real!</b>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;strong&gt; &lt;/strong&gt;</h3>}
            text={
              <p>
                Відображають вміст жирним шрифтом.
                <br />
                <strong>This can't be real!</strong>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;i&gt; &lt;/i&gt;</h3>}
            text={
              <p>
                Виділення тексту курсивом. <br />
                <i>This can't be real!</i>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;var&gt; &lt;/var&gt;</h3>}
            text={
              <p>
                Виділення тексту курсивом.
                <br />
                <var>This can't be real!</var>
              </p>
            }
          />
          <TableTwoCol
            title={<h3>&lt;wbr /&gt;</h3>}
            text={
              <p>
                Надає можливість перенесення слова – позицію в тексті, де
                браузер може за бажанням розбити рядок, інакше правила розриву
                рядка не створюватимуть розрив у цьому місці.
              </p>
            }
          />
        </TableBody>
      </Table>
    </>
  );
}
